src/main/resources/uml/03-클래스-분리.mermaid
classDiagram
    class PaymentService {
        + prepare()
    }
    class HttpApiExchangeRateProvider {
        + getExchangeRate()
    }
    class SimpleExchangeRateProvider {
        + getSimpleExchangeRate()
    }

    PaymentService ..> HttpApiExchangeRateProvider: 사용
    PaymentService ..> SimpleExchangeRateProvider: 사용
