src/main/resources/uml/03-클래스-분리.puml
@startuml
class PaymentService {
    + prepare()
}

class HttpApiExchangeRateProvider {
    + <color:blue>getExchangeRate()</color>
}

class SimpleExchangeRateProvider {
    + <color:red>getSimpleExchangeRate()</color>
}

PaymentService ..> HttpApiExchangeRateProvider : 사용
PaymentService ..> SimpleExchangeRateProvider : 사용
@enduml
